{
  "DatingCharacterEvent.103301.1": "Suddenly, you and Amber hear a cat meowing.\n\nAmber dashes off to search for the source of the sound and quickly finds a kitten.",
  "DatingCharacterEvent.103301.2": "You are amazed by her magical \"cat-attracting aura.\" Gasping for breath, you tell her that you can't keep up with her pace.",
  "DatingCharacterEvent.103301.3": "Amber holds the cat in her arms, a hint of reluctance on her face—she knows the New Star Guild isn't in a position to take it in.\n\nSo, the two of you choose to fully enjoy this moment of tranquility... with the kitten.",
  "DatingCharacterEvent.103301.5": "The Kitten Encounter",
  "DatingCharacterEvent.103301.6": "Visit the Port to unlock",
  "DatingCharacterEvent.103301.7": "You and Amber came across a lost kitten at the Port. It was attracted by the fish smell.\n\nAlthough you weren't in a position to adopt it, the two of you enjoyed your time spent with the kitten.",
  "DatingCharacterEvent.103303.1": "You and Amber walk into the student cafeteria, look around and finally find a counter that doesn't require a student card to pay. You both point across the counter at the dishes you want, but the way the cafeteria auntie swings her ladle gives you a bad feeling.",
  "DatingCharacterEvent.103303.2": "At first, she scoops up five meatballs at once, and you and Amber gasp quietly. With a flick of her wrist, one rolls away. Another shake, another meatball slips out. By the time she serves the dish, she kept another meatball in the ladle.",
  "DatingCharacterEvent.103303.3": "The two of you stare miserably at the plate. One meatball for each of you, but what about the rest? You exchange helpless glances at the impossible pile of green leaves. Sigh—maybe you'll take Amber somewhere else to eat after this.",
  "DatingCharacterEvent.103303.5": "Cafeteria Trick",
  "DatingCharacterEvent.103303.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.103303.7": "At the student cafeteria, you and Amber experienced the infamous \"ladle technique\". Your heartbeats rushed with each swing of the ladle. Why is it that even in the cafeteria, what you see is never what you get?",
  "DatingCharacterEvent.107301.1": "The shop employee eagerly points to a poster, explaining a promotion.\n\nUnexpectedly, Tilia leans in to scrutinize the fine print.",
  "DatingCharacterEvent.107301.2": "\"Hmm, as far as I can tell from the description here, there doesn't seem to be any rule violations.\"\n\nShe sighs and returns to her seat.",
  "DatingCharacterEvent.107301.3": "\"Hmph, I guess I might be a little too obsessed with Imperial Guard's work,\" she says, scratching her head in embarrassment.\n\nStill, you can't help but feel that she's radiating the aura of a \"champion of justice.\"",
  "DatingCharacterEvent.107301.5": "Out of Habit",
  "DatingCharacterEvent.107301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.107301.7": "You and Tilia came across a raffle event at the dessert shop.\n\nHer first instinct, however, was to check if the event was complying with all regulations.\n\nWhat a diligent and justice-minded will-be knight she is... If only all Imperial Guard Knights were as dedicated as her.",
  "DatingCharacterEvent.107302.1": "A furtive-looking man pushes past you and walks away briskly, nearly causing you to lose your balance.",
  "DatingCharacterEvent.107302.2": "In the distance, the shout of \"Stop, thief!\" rings out, and Tilia immediately springs into action, chasing after the commotion.\n\nShe quickly intercepts the suspect, shows him her credentials, and begins to question him. The case is solved on the spot.",
  "DatingCharacterEvent.107302.3": "\"Sorry, please give me a moment to make a call... Hmph, wasting my time—it's supposed to be my day off!\"\n\nThe on-duty knights soon arrive at the scene, allowing the two of you to resume your day of leisure. You notice that Tilia's smile seems just a little brighter than before.",
  "DatingCharacterEvent.107302.5": "Solved On the Spot",
  "DatingCharacterEvent.107302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.107302.7": "While strolling through the market with Tilia, the two of you encountered a thief.\n\nEven though it was her day off, Tilia swiftly apprehended the criminal. Although it cost her a bit of free time, her smile grew even brighter after justice was upheld.",
  "DatingCharacterEvent.108301.1": "You and Kasimira reach a cliff.\n\n\"There's a shortcut this way,\" she says.\n\nShe extends her hand out to you.",
  "DatingCharacterEvent.108301.2": "Just as you're wondering what Kasimira has planned, she grabs your arm, effortlessly lifts you up, and in a few swift, powerful jumps, lands on the other side of the broken bridge.\n\nBefore you can even wrap your head around what just happened, she gently sets you down—her agility and strength leave you thoroughly impressed.",
  "DatingCharacterEvent.108301.3": "\"It's nothing. This is nowhere near as dangerous as the battlefield.\"\n\nEven though her words are confident, you're certain you saw a flash of nervousness on her face just now.\n\nYou wonder—What could have caused her to falter, even for a single moment?",
  "DatingCharacterEvent.108301.5": "Impressive Skills",
  "DatingCharacterEvent.108301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.108301.7": "While exploring the cave with Kasimira, you came across a broken bridge.\n\nShe escorted you across the gap in just a few swift leaps. As she soars with you in her arms, you finally understand why they are called the White Cat Troupe.",
  "DatingCharacterEvent.108302.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nAt the dart booth, Kasimira grabs 20 darts without any hesitation.",
  "DatingCharacterEvent.108302.2": "Bullseye, bullseye, bullseye...\n\nBy the time Kasimira throws her tenth dart, the center of the target is already running out of space.\n\nThe booth owner awkwardly suggests, \"Maybe you can take a break and just claim the grand prize already.\"",
  "DatingCharacterEvent.108302.3": "\"The prize doesn't really matter. I just think this is pretty fun.\"\n\nThus you quietly stand to the side, watching her darts hitting bullseye after bullseye.\n\nIt's time for her to fully enjoy herself.",
  "DatingCharacterEvent.108302.5": "Flawless Accuracy",
  "DatingCharacterEvent.108302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.108302.7": "Kasimira, with her gunfighting skills, made the dart game look effortless.\n\nYou thought she was aiming for the grand prize, but it turned out she was genuinely enjoying the thrill of hitting every bullseye.",
  "DatingCharacterEvent.111301.1": "The tension eases, and Iris starts to relax a little.\n\nShe begins to talk about her recent troubles.",
  "DatingCharacterEvent.111301.2": "The guild's budget, the challenges of working as a Trekker, fluctuating market prices, restrictions imposed by the Cities... She goes through the laundry list.\n\nYou listen attentively, occasionally reminding her to take a bite of her dessert.",
  "DatingCharacterEvent.111301.3": "After pouring out all her worries, she seems to feel much better.\n\n\"Do you think I'm being a burden?\" she asks, lowering her head with a hint of guilt. \"I shouldn't be talking about all this on a rare day off...\"\n\nBut you know it's only because she's the most caring and gentle soul.\n\nYou decide to order her the sweetest special drink of the day.",
  "DatingCharacterEvent.111301.5": "The Bitter and the Sweet",
  "DatingCharacterEvent.111301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.111301.7": "You shared desserts with Iris at the shop.\n\nShe opened up about her worries and troubles. Luckily, the tasty sweets and your supportive company seemed to lift her spirits.\n\nYou've got this, Iris!",
  "DatingCharacterEvent.111303.1": "Entering the library, you notice Iris's steps have become lighter. After so long in the Wilds, she needs the refuge of civilization.",
  "DatingCharacterEvent.111303.2": "You know she once dreamed of joining a large company.\n\nSo you talk about big corporations as well as those \"small and beautiful\" ones. Then about what \"small\" and \"beautiful\" even mean.",
  "DatingCharacterEvent.111303.3": "Eventually you agree that big companies are like walled cities: outsiders want in and insiders want out.\n\nBut aside from all that, safety in the Wilds matter most for the guild. To avoid being swallowed by storms, reefs, and quicksand, the guild needs an actuary. And here she is, beside you, gathering knowledge.",
  "DatingCharacterEvent.111303.5": "Library Talk",
  "DatingCharacterEvent.111303.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.111303.7": "You and Iris went to the library. For her, it must be a place of relaxation. The life she once dreamed of lies hidden just behind that bookshelf. The shelf is large and sturdy, but it also blocks the sunlight streaming in from the window.",
  "DatingCharacterEvent.112301.1": "You spot a beautiful mushroom and are just about to take a bite when Noya stops you.\n\"Eating this raw will make you hallucinate.\"\n\nShe then examines the mushroom with a mischievous look.",
  "DatingCharacterEvent.112301.2": "\"But if you cook it, it's perfectly fine.\"\n\nShe expertly gathers some dry branches and leaves, stacks up a small stone stove, pulls out a firestarter, and builds a fire.\n\n\"Just a quick roast... Mmm, smell amazing, doesn't it?\"",
  "DatingCharacterEvent.112301.3": "The two of you gather the nearby mushrooms and feast on them together.\n\nDelicious as they are, you are starting to feel dizzy.\n\"Don't worry. If it comes to it, I'll carry you.\" After a short break, Noya helps you up and the two of you continue on your journey.",
  "DatingCharacterEvent.112301.5": "Foraging Cuisine",
  "DatingCharacterEvent.112301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.112301.7": "With Noya's help, you learned about yet another type of dangerous mushroom and how to safely prepare it.\n\nIt was unexpectedly delicious treat when roasted—though it did make you feel a bit dizzy.\nMaybe Noya's knowledge is not quite complete?",
  "DatingCharacterEvent.112302.1": "Suddenly, a burst of excitement erupts from the crowd in a distance.\n\nA street performance has begun.\n\nIt's a exhibition match of swordsmanship.\n\nWatching the action, Noya looks like she's itching to give it a try herself.",
  "DatingCharacterEvent.112302.2": "She asks for your opinion, and with her bright, eager eyes staring at you, there's no way you can say no.\n\nShe steps onto the stage, grips the sword, and looks absolutely badass.",
  "DatingCharacterEvent.112302.3": "Noya's movements are lightning-fast, striking several scoring points in quick succession. The match ends swiftly in a one-sided victory.\n\nAfter the match has ended, you both overhear the opponent grumbling, \"How are us performers supposed to go head-to-head with a real Trekker?\"\n\nNoya scratches her head sticks her tongue out at you with a sheepish grin.",
  "DatingCharacterEvent.112302.5": "The Professional",
  "DatingCharacterEvent.112302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.112302.7": "You watched Noya as she partook in a swordplay match and clinched victory. In the roaring cheers of the crowd, you wonder: Are all Trekkers this skilled in combat?",
  "DatingCharacterEvent.113301.1": "The small table is covered with an array of cakes and drinks.\n\nShimiao stares at them hesitatingly.",
  "DatingCharacterEvent.113301.2": "\"Just one meal shouldn't make me gain weight.\"\n\nShe mutters to herself.\n\nNoticing her hesitation, you grab your fork and dig in, letting Shimiao know through your actions that she doesn't need to stress about it.",
  "DatingCharacterEvent.113301.3": "She hesitates for a moment before finally digging in.\n\n\"Oh well,\" she seems to be talking to herself, \"I guess, worst case scenario, we'll gain weight together.\"",
  "DatingCharacterEvent.113301.5": "Alliance Sealed by Cake",
  "DatingCharacterEvent.113301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.113301.7": "You had a great time with Shimiao at the Dessert Shop. \n\nAt first, she seemed worried about the sweets making her gain weight, but eventually she gave in to her cravings and the allure of the delicious treats.",
  "DatingCharacterEvent.113302.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nWhat you didn't expect was that Shimiao got hooked on the whack-a-mole game booth. She ends up buying game tokens for several rounds.",
  "DatingCharacterEvent.113302.2": "\"Bang—bang—\"\n\nAgain and again, Shimiao brings her mallet down on the moles with both precision and force.\n\nYou begin to worry she's going break the machine—and whether she's been under too much stress at work.",
  "DatingCharacterEvent.113302.3": "\"That felt so good!\" She exclaims as the game finally comes to an end.\n\nAfter this brief moment of relaxation, she adjusts her glasses and, once again, becomes the model secretary.\n\n\"Let's go, Boss, next stand.\"\n\nWatching her walk confidently, you feel a little less worried.",
  "DatingCharacterEvent.113302.5": "Pressure Relief",
  "DatingCharacterEvent.113302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.113302.7": "While you were at the market with Shimiao, you visited the whack-a-mole game booth.\n\nThough she wasn't particularly good at it, the sheer force of her hits made you worry about her mental well-being.\n\nFortunately, after letting off some steam, she seemed to have found a sense of inner peace.",
  "DatingCharacterEvent.116301.1": "You rest against the rock wall. Suddenly, Ridge seems to smell something, and she starts digging at the soil with her shovel.",
  "DatingCharacterEvent.116301.2": "Ridge uncovers some dirt and gravel, and finally digs out a huge white mushroom.\n\n\"This kind of mushroom must be eaten fresh,\" she explains excitedly.",
  "DatingCharacterEvent.116301.3": "After a simple roast, the mushroom gives off a tempting fragrance. As you share it, you discuss how she found it.\n\nMaybe in the near future, Ridge's farm will also cultivate this delicious mushroom.",
  "DatingCharacterEvent.116301.5": "Mushroom Scent",
  "DatingCharacterEvent.116301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.116301.7": "You and Ridge discovered a delicious giant mushroom deep inside the cave. Could this delicacy be cultivated on a farm? It may require very exact conditions, but you would trust United Harvest's technology.",
  "DatingCharacterEvent.116302.1": "You order many more desserts. Ridge doesn't seem to come to the Dessert Shop often, so let her enjoy this chance.",
  "DatingCharacterEvent.116302.2": "So satisfying, but you really ordered too much. As you wipe the crumbs from your mouth, you notice Ridge seems like she wants to say something—probably that she wants to pack the rest and take it home.",
  "DatingCharacterEvent.116302.3": "You call the waiter to pack the leftovers.\n\nThen you give most of it to Ridge, reminding her to eat quickly because cake doesn't keep for long.",
  "DatingCharacterEvent.116302.5": "Cakes To-Go",
  "DatingCharacterEvent.116302.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.116302.7": "Together with Ridge, you ordered way too much at the Dessert Shop. You give her most of the extra. Cakes may be tasty, but they don't last long. Ridge, who loves stockpiling food, probably doesn't eat it often.",
  "DatingCharacterEvent.117301.1": "While waiting for food,Jinglin runs to the kitchen's display window, peeking inside out of curiosity.",
  "DatingCharacterEvent.117301.2": "You come up behind her and tap lightly on her shoulder.\n\nJinglin is a bit startled and turns around to greet you.\n\n\"B-Boss, I was just curious about how they make their desserts here!\"",
  "DatingCharacterEvent.117301.3": "\"I see, then let's watch together.\" Before your food is served, you and Jinglin observe the chef's exquisite skills.",
  "DatingCharacterEvent.117301.5": "A Study in Dessert",
  "DatingCharacterEvent.117301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.117301.7": "When you met up with Jinglin at the dessert shop, she was standing outside the work area glass, observing the dessert preparation process.\n\nHer curiosity about food was admirable.",
  "DatingCharacterEvent.117302.1": "You and Jinglin stumble upon an area full of mushrooms.\n\nHer eyes widen with excitement as she starts to examine the different shapes and varieties.",
  "DatingCharacterEvent.117302.2": "\"This one is probably poisonous.\"\n\nAs she picks through the mushrooms, Jinglin keeps talking to herself.\n\n\"This one's edible... This one can be eaten once cooked.\"\n\nYou also pick a few, trying to identify the mushrooms that look similar, but soon realize it's a tricky task.",
  "DatingCharacterEvent.117302.3": "\"What a haul! I'll try out a new recipe when we get back!\"\n\nJinglin happily leaves with a whole lot of mushrooms.\n\n\"Don't try this at home, though. I do this because I know what I'm doing!\"",
  "DatingCharacterEvent.117302.5": "Freshly Picked",
  "DatingCharacterEvent.117302.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.117302.7": "You and Jinglin discovered a great variety of mushrooms inside the cave.\n\nWith her extensive knowledge, she quickly identified all the edible mushrooms and packed them up to go... She was elated.",
  "DatingCharacterEvent.118301.1": "Suddenly, it feels like you've stepped on something hard.\n\nYou look down and realize that underneath the vegetation, there lies a skeleton covered in layers of mud and dirt.\n\nLike a predator smelling prey, Coronis immediately moves closer.",
  "DatingCharacterEvent.118301.2": "\"Could it be that you're interested in this, too?\"\n\nShe teases you.\n\nBefore you can answer, she pulls out a specimen box and excavation tools. You wisely step aside, making room for her to work.",
  "DatingCharacterEvent.118301.3": "Now that her work has happily concluded, Coronis is in high spirits. She seems to float rather than walk.\n\n\"Life is intriguing,\" you can't help but think to yourself.",
  "DatingCharacterEvent.118301.5": "Freshly Unearthed",
  "DatingCharacterEvent.118301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.118301.7": "You and Coronis discovered the remains of an unknown creature in the cave.\n\nDriven by her passion for science and medicine, she dug up some specimens and kept them. Death is not the end. It carries infinite hope.",
  "DatingCharacterEvent.118303.1": "You walk into the library with Coronis. She glances at the map and heads straight for the medical section.",
  "DatingCharacterEvent.118303.2": "Seeing your puzzled look, she explains, \"Though people call me a country doctor, I actually have a proper degree.\"",
  "DatingCharacterEvent.118303.3": "Coronis flips through the latest journals: \"New academic findings sometimes help my research.\" Then she looks at you with burning eyes. You shrink your neck in unease. She smiles lightly, \"Don't worry, today you're perfectly healthy.\"",
  "DatingCharacterEvent.118303.5": "Burning Gaze",
  "DatingCharacterEvent.118303.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.118303.7": "With Coronis, you read medical journals in the library. Though she's been away from academia for a long time, she keeps up with the latest theories. Theory and practice are like two legs of progress—sometimes one leads, sometimes the other.",
  "DatingCharacterEvent.119301.1": "The small table is covered with an array of cakes and drinks.\n\nOnce the staff brings out the final dessert, Nanoha looks at you with a cheerful smile.\n\n\"Actually... I have a surprise prepared just for you.\"",
  "DatingCharacterEvent.119301.2": "\"One of these little cakes is made just for you, with all your favorite flavors mixed in. Would you care to guess which one?\"\n\nExcited by the fun challenge, you dive in and start tasting them one by one.",
  "DatingCharacterEvent.119301.3": "The moment that perfect flavor hits your taste buds, you know exactly which one it is.\n\n\"That is a relief! Looks like I do know you to some degree...\"\n\nUnder Nanoha's eager gaze, you quickly devour the one-of-a-kind little cake made just for you.",
  "DatingCharacterEvent.119301.5": "Customized Sweetness",
  "DatingCharacterEvent.119301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.119301.7": "Nanoha invited you to the dessert shop. Everything felt so familiar, even the staff knew you by sight.\n\nHowever, this time there was a special surprise waiting for you—she prepared something unique and sweet just for you.",
  "DatingCharacterEvent.119302.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nThe dart booth catches your eye. Seeing this, Nanoha suggests giving it a try.",
  "DatingCharacterEvent.119302.2": "You go first and dispatch five darts. Unfortunately, none of them hit the spot exactly, leaving you a little frustrated.\n\n\"Please, allow Nanoha to win this for you,\" Amidst the noisy crowd, Nanoha whispers softly into your ear.",
  "DatingCharacterEvent.119302.3": "\"Whoosh, whoosh—\"\n\nBefore you can even react, Nanoha swiftly throws all her darts, each landing perfectly in the bullseye.\n\nThe crowd goes silent for a few seconds before erupting in astonished exclamations, with everyone asking Nanoha to share her secret.\n\nNanoha looks flustered. You know she's not used to scenes like this so you quickly lead her away from the booth.",
  "DatingCharacterEvent.119302.5": "The Best Maid",
  "DatingCharacterEvent.119302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.119302.7": "Nanoha had no mission to attend to for once, so she invited you to explore the Market with her.\n\nAt the dart-throwing booth, you saw a different side of her—calm, confident, and remarkably skilled.",
  "DatingCharacterEvent.120301.1": "Carrying torches, you make your way deeper into the cave.\n\nSuddenly, out of the corner of your eye, you catch sight of a wall painting. Excited, you call out to Canace.",
  "DatingCharacterEvent.120301.2": "Canace comes over, unhurried, and points out that the wall painting shows signs of modern craftsmanship, clearly not what you're searching for.\n\nShe gently pats your shoulder and suggests calling it a day.",
  "DatingCharacterEvent.120301.3": "When you return to the cave entrance, you realize it's raining hard outside.\n\nCanace notices your disappointment. She gets a fire going and pats the ground, motioning for you to sit beside her.\n\n\"You know,\" she begins, \"our ancestors once did the same thing—sitting at the edge of caves during the rainy season, resting, reproducing, and perhaps even beginning to think.\"\n\nYou gaze into the flickering flames, listening as she recounts stories from a time before time.",
  "DatingCharacterEvent.120301.5": "When It Rains, It Pours",
  "DatingCharacterEvent.120301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.120301.7": "You ventured into a cave with Canace in search of clues about an ancient civilization. Your hope for a new discovery, however, was dashed. When you tried to leave the cave, it started to rain. Canace comforted you and shared stories from a time before time.",
  "DatingCharacterEvent.120303.1": "\"Getting hungry? Let me take you to the staff cafeteria.\" Canace notices you're starving.",
  "DatingCharacterEvent.120303.2": "The staff cafeteria is upstairs from the student one. Canace leads you inside. \"We get better food here. Order whatever you want.\"\n\nYou order a simple meal, but Canace adds more.",
  "DatingCharacterEvent.120303.3": "The food really does taste better than what's served downstairs.\n\nYou notice Canace hardly eats any of it. Why did she order so much?\n\nLeaning lazily in her chair, her gaze drifts toward your plate now and then. You realize she just wanted you to eat more—maybe, unconsciously, she's already treating you like her student.",
  "DatingCharacterEvent.120303.5": "Faculty Cafeteria",
  "DatingCharacterEvent.120303.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.120303.7": "Taken by Canace to the faculty cafeteria, you discovered the food there is markedly better than the students' meals. You enjoyed your meal and realized that even the so-called \"Devil Teacher\" had a caring side.",
  "DatingCharacterEvent.123301.1": "Ann suddenly comes running. She grabs your hand and pulls you forward, saying she's discovered some mysterious treasure inside a cave.",
  "DatingCharacterEvent.123301.2": "As you venture deeper into the cave, a beautiful, melodic tune drifts out. Moving closer, you find it's a music box left behind by someone.",
  "DatingCharacterEvent.123301.3": "\"This must be a gift from the mountain god for you, Ann. Let me show you how to use it.\"\n\nSeeing Ann's anticipation, you offer a reasonable explanation, and she looks overjoyed.",
  "DatingCharacterEvent.123301.5": "Gift from the Mountain God",
  "DatingCharacterEvent.123301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.123301.7": "You and Ann discovered an abandoned music box inside the cave. She's never seen such a thing before. Ann was eager to know how to make the little box sing again, fiddling with it nonstop until you finally taught her how to wind it.",
  "DatingCharacterEvent.123302.1": "The two of you decide to explore the game area and see what fun activities it has to offer.\n\nSuddenly, Ann is entranced by a ring toss game.",
  "DatingCharacterEvent.123302.2": "The grand prize is a beautifully decorated watering can. \n\nAnn says she wants to win it, but after a few tries, she hasn't had any luck. You're tempted to step in and win it for her, but you don't want to overstep.",
  "DatingCharacterEvent.123302.3": "Before she tosses the next ring, you lift her up.\n\n\"I'm as tall as you now, Bossy!\"\n\nExcited, she tosses the final ring and clinches the grand prize.\n\n\"Thank you, Bossy! I'll treasure it forever!\"\n\nYou smile and pat her on the head, tell her that you're sure she will use it well.",
  "DatingCharacterEvent.123302.5": "View From High",
  "DatingCharacterEvent.123302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.123302.7": "While exploring the market with Ann, you noticed her eyeing a watering can at the ring toss game.\n\nAfter a few failed attempts, you lifted her up carefully, giving her a higher vantage point. She nailed it on her next try.",
  "DatingCharacterEvent.125301.1": "You spot mushrooms growing in cracks along the rock wall.\n\n\"These must be top-notch ingredients,\" you say, handing one to Freesia.\n\nInside the dim cave, the brightly colored mushroom looks very appetizing.",
  "DatingCharacterEvent.125301.2": "You quickly pop the mushroom into your mouth. The flavor is somewhat bland but the texture is excellent.\n\nFreesia grabs your shoulder nervously. You don't understand why she's overreacting so much—or, for that matter, what she's saying.\n\nIn your eyes, Freesia suddenly grows a pair of wings, her hair flowing freely as if she's an angel. Then her figure begins spinning and twisting rapidly, shrinking until she becomes nothing more than a tiny dot...",
  "DatingCharacterEvent.125301.3": "\"Ugh—!\"\n\nA bright beam of light cuts through the strange world in your mind, pulling you back to reality. You find yourself wrapped in Freesia's warm jacket.\n\n\"Phew... You're finally awake,\" Freesia sighs with relief and puts down her flashlight. \"The book's method for breaking hallucinations actually worked.\"\n\n\"You were completely entranced. Could it have some kind of special magic?\"\n\nFreesia looks thoughtful.",
  "DatingCharacterEvent.125301.5": "The Mysterious Mushroom",
  "DatingCharacterEvent.125301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.125301.7": "While exploring the cave with Freesia, you fell victim to the mysterious \"mushroom magic\"!\n\nThe Freesia in your hallucination was an untouchable divine phantom. Thankfully, in reality, she stayed by your side throughout.",
  "DatingCharacterEvent.125302.1": "The sweet seems to lift Freesia's spirits, and you notice her starting to relax.\n\"I knew it... I always feel happy when I'm with you.\"",
  "DatingCharacterEvent.125302.2": "Freesia, who's not one to open up easily, tells you about her dilemma: During one of her deliveries, she helped an elderly woman. Since then, every time she visits to deliver mail, the old lady warmly invites her to stay for a meal.\n\nFreesia doesn't want to trouble her but isn't sure how to politely decline without hurting her feelings.",
  "DatingCharacterEvent.125302.3": "You tell Freesia to share how she truly feels, the old lady is sure to understand.\n\nFreesia nods, a look of realization on her face. You've helped her resolve something that's been bothering her for a while.",
  "DatingCharacterEvent.125302.5": "True Heart",
  "DatingCharacterEvent.125302.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.125302.7": "Freesia invited you to meet at the Dessert Shop, but you noticed she seemed a bit down.\n\nAfter hearing her story, your advice helped Freesia resolving the issue. Interpersonal relationships are often not as complicated as we imagine.",
  "DatingCharacterEvent.126301.1": "Flora tells you there's an even better dessert shop nearby, so you hop over. This one feels fancier, and while scanning the menu you notice they are selling celeb collaboration items.",
  "DatingCharacterEvent.126301.2": "You carefully read the menu again, determined not to miss a single detail, and finally spot the one you want in the menu's corner.\n\nMeanwhile, Flora has already finished her black tea. She wonders why your order hasn't arrived yet.",
  "DatingCharacterEvent.126301.3": "The waitress brings over a mousse cake and a cup of black tea that comes with your special celebrity collaboration merchandise.\n\n\"I didn't ... I didn't know they'd still have any left...\"\n\nFlora picks up her empty teacup to pretend she's sipping the tea, but you notice the faint blush spreading across her cheeks.",
  "DatingCharacterEvent.126301.5": "The Celebrity",
  "DatingCharacterEvent.126301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.126301.7": "Flora treated you to a dessert shop. You saw that they sell celebrity collaboration goods, so you ordered one tied to the star you were most familiar with. But the real person sitting across from you had more charm.",
  "DatingCharacterEvent.126302.1": "Suddenly, a burst of excitement erupts from the crowd in a distance.\n\nA street magic performance has begun.",
  "DatingCharacterEvent.126302.2": "The impromptu magic performance draws gasps of amazement from the crowd.\n\nHowever, it seems the performer is nervous. You notice that she's missing a card from her deck.",
  "DatingCharacterEvent.126302.3": "Suddenly, you notice a playing card streaking through the crowd like a swift falcon, filling the gap in the performer's routine before anyone can notice it.\n\nYou turn to see Flora smiling, giving you a playful wink.",
  "DatingCharacterEvent.126302.5": "Outside Help",
  "DatingCharacterEvent.126302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.126302.7": "You and Flora watched a street magic performance together. You were lucky to witness this master magician giving aid to the young performer.",
  "DatingCharacterEvent.127301.1": "You carefully make your way through jagged stalagmites, but one stumble and you end up scraping your knee.",
  "DatingCharacterEvent.127301.2": "You instinctively reach for some gauze for a quick bandaging, but Teresa stops you.\n\n\"If you get hurt in an unknown environment, you need to disinfect the wound first.\"",
  "DatingCharacterEvent.127301.3": "She carefully cleans your wound, as if she's done this countless times before. It pains you to think how much experience she must have had to become this skilled.",
  "DatingCharacterEvent.127301.5": "Practice Makes Perfect",
  "DatingCharacterEvent.127301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.127301.7": "While exploring the cave with Teresa, you got cut by some gravel. Teresa immediately tended to your wound. What should have been a painful experience turned out surprisingly gentle thanks to her practiced care.",
  "DatingCharacterEvent.127302.1": "After exploring the market, Teresa takes out a beautifully wrapped gift. She had secretly picked it out earlier at the market.",
  "DatingCharacterEvent.127302.2": "You look at the gift you've prepared for her.\n\n\"I can guess what you're going to give me, so I've got the same gift ready for you in return.\"",
  "DatingCharacterEvent.127302.3": "You swap gifts. Sure enough, they're both band-aids, each with a unique design. Teresa jumps up with joy and then carefully puts the gift you gave her into her backpack.",
  "DatingCharacterEvent.127302.5": "Bond-Aid",
  "DatingCharacterEvent.127302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.127302.7": "After exploring the market with Teresa, you exchanged gifts. As you had expected, you both ended up getting band-aids for each other. Life is full of bumps and scrapes, but thankfully we can bandage each and every one of them.",
  "DatingCharacterEvent.132301.1": "You lead Minova deeper into the cave. A faint light starts to glow ahead.\n\nA vast expanse of bioluminescent plants appears before you, transforming the dim cave into a dazzling river of stars.",
  "DatingCharacterEvent.132301.2": "Minova gazes at the scene in awe.\n\n\"Look, if you collect the sap from the plants like this...\"\n\nYou cut a leaf, and a fluorescent sap drips into the container.",
  "DatingCharacterEvent.132301.3": "When you pull out the unpainted skateboard you've been carrying, Minova's eyes light up. \"This is awesome!\"\n\nLooks like she's finally got what you meant.",
  "DatingCharacterEvent.132301.5": "Bioluminescence",
  "DatingCharacterEvent.132301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.132301.7": "Together with Minova, you discovered glowing plants in the cave.\n\nYou carefully gathered up their sap, and she quickly caught on, marveling at your idea.",
  "DatingCharacterEvent.132303.1": "Minova leads you into the library, saying she knows where the books you'd like are.\n\nShe wanders the shelves with ease, as if she were at home.",
  "DatingCharacterEvent.132303.2": "\"Look!\" She pulls out \"An Introduction to Artifact Appraisal.\" \"Read this and you won't get scammed by shady merchants.\"\n\nShe hands it to you with an awkward smile. \"Hope it helps on your journey.\"",
  "DatingCharacterEvent.132303.3": "Using her student card, Minova checks the book out for you. Beneath it, you notice another book—perhaps a shoujo manga.\n\nShe seems to notice your glance and stammers, \"Just remember to return it on time, okay?\"",
  "DatingCharacterEvent.132303.5": "Borrowing Books",
  "DatingCharacterEvent.132303.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.132303.7": "You explored the library with Minova and she checked out a useful book for you.\n\nAnd though she tried to hide it, you noticed that she slipped a shoujo manga in there, too.",
  "DatingCharacterEvent.134301.1": "You and Fuyuka bumped into the shopkeeper. \"Well, if it isn't Lady Fuyuka! Don't tell me you're on a secret date?\" Fuyuka was so flustered she nearly fainted.",
  "DatingCharacterEvent.134301.2": "With your help, she finally managed to fend off the questioning, but things didn't end there...\n\"Lady Fuyuka, how about being our Manager for a Day? I bet the shop would be packed!\"\nThe shopkeeper's eager sincerity left Fuyuka with no way to turn the invitation down.",
  "DatingCharacterEvent.134301.3": "Just as the shopkeeper predicted, Fuyuka's popularity drew in a huge crowd. As thanks, the shopkeeper not only doubled the payment but also personally prepared freshly baked cakes for you and Fuyuka.\n\"The cake is good. It's all thanks to you, Fuyuka.\"\n\"Heh... Hehe, it's only because of your encouragement, Master...\"",
  "DatingCharacterEvent.134301.5": "Manager for a Day",
  "DatingCharacterEvent.134301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.134301.7": "You went to the dessert shop with Fuyuka, and the shopkeeper noticed her, so she got roped into being the Manager for a Day.\nThe two of you walked away with generous pay and delicious cakes. It was tiring, but sweet in every sense.",
  "DatingCharacterEvent.134302.1": "The cave was growing darker. You could sense Fuyuka's hesitation, so you decided to stop for a while.\n\"I... I'm not scared...\"\n\"It's fine even if you are,\" you said with a smile.",
  "DatingCharacterEvent.134302.2": "Even with your comfort, a trace of unease still lingered on Fuyuka's face.\n\"Master... Are there things you're afraid of too?\"\n\"Of course,\" you said. \"But being afraid doesn't mean being cowardly. You're just worried about the dangers ahead, that's why you hesitate, right? Caution is a good thing.\"",
  "DatingCharacterEvent.134302.3": "\"In the end, a hero isn't someone without fear, it's someone who can still step forward to face it when it matters the most.\"\n\"T-Then ... if we really run into danger, I'll protect you, Master!\"\n\"I know you will.\"\nFuyuka finally relaxed, a bright smile spreading across her face.",
  "DatingCharacterEvent.134302.5": "The Brave One's Proposition",
  "DatingCharacterEvent.134302.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.134302.7": "You and Fuyuka ventured into The Cave together. Partway through, she sensed danger ahead and decided to stall for a bit.\nWorried that you might think her a coward, she grew uneasy. You saw through it, reassured her, and taught her what courage truly means.\nYour words brought her relief and your bond grew a little stronger.",
  "DatingCharacterEvent.135301.1": "In the innermost part of the cave, Mistique discovers a massive shrine, inside which is a giant projector artifact.",
  "DatingCharacterEvent.135301.2": "Judging by the nearby wall paintings, it seems that those who worshiped here believed the image revealed by the artifact was that of a deity's.\n\nMistique excitedly grabs her camera and starts clicking.\n\n\"What a rare find! An actual archaeological discovery!\"",
  "DatingCharacterEvent.135301.3": "\"Aren't you going to take it?\" you ask.\n\n\"News is not only about front page, but to preserve the site and truth.\"\n\nLooks like the Witch sticks to her principles.\n\nYou smile at each other and carry on with your journey.",
  "DatingCharacterEvent.135301.5": "Archaeological Discovery",
  "DatingCharacterEvent.135301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.135301.7": "While exploring the cave with Mistique, you discovered the remains of an ancient shrine dedicated to a powerful Artifact.\n\nMistique documented and preserved the site, noting that this was in keeping with the professional ethics of a great Witch.",
  "DatingCharacterEvent.135302.1": "Time flies by. It seems you've visited every section you are interested in.\n\nMistique says there's something she wants to read on her own.\n\nSo you part ways for a little while. With your legs feeling sore, you find a chair to rest on. Before you know it, you've drifted off to sleep.",
  "DatingCharacterEvent.135302.2": "Time flies by. You wake up from your nap to the sound of a camera clicking.\n\nMistique has returned and she's taking pictures of your sleeping face.",
  "DatingCharacterEvent.135302.3": "\"This is a nice memento.\"\n\nShe chuckles softly and carefully puts the camera away.\n\n\"This is a successful material gathering today.\"",
  "DatingCharacterEvent.135302.5": "Material Gathering",
  "DatingCharacterEvent.135302.6": "Visit the Academy to unlock",
  "DatingCharacterEvent.135302.7": "After strolling the library with Mistique, you were exhausted and fell asleep in a chair.\n\nMistique seized this opportunity to snap a photo of your sleeping face.\n\nDespite all your protests, it seemed unlikely she will ever hand this photo over to you.",
  "DatingCharacterEvent.141301.1": "In the innermost part of the cave, you find the walls covered in murals.",
  "DatingCharacterEvent.141301.2": "These murals are wildly abstract, much like the careless scribbles of a three-year-old. They look strange indeed inside the damp, dim cave.\n\nAnd then you notice that Chixia isn't scared of the dark anymore. In fact, she's so excited that sparks are flying from her tail.",
  "DatingCharacterEvent.141301.3": "\"What kind of genius made this?!\" Chixia practically presses herself against the wall. \"Look! This Loong looks so real! This is amazing! And look at this phoenix—it feels like it's about to fly right off the wall!\"\n\nThat's when it hits you—the style of these murals is almost identical to the way Chixia draws.",
  "DatingCharacterEvent.141301.5": "The Mural Master",
  "DatingCharacterEvent.141301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.141301.7": "After marveling at the \"masterpiece murals\" inside the cave, Chixia begins to dream about one day becoming a mural master.\n\nShe promises that when that day comes, she'll gift you with a masterpiece, signed personally by her.",
  "DatingCharacterEvent.141302.1": "Chixia suddenly spots a strange little cake sitting in the dessert shop's display case.\n\nIts lopsided frosting is piled on top, like a crooked pagoda about to collapse at any moment.",
  "DatingCharacterEvent.141302.2": "\"I want that one!\"\n\nChixia's eyes light up as she points at the small cake, excitedly placing her order. However, she is told it's actually a failed practice attempt made by one of the shop's new apprentices.\n\nSeeing her stunned by the words \"failed,\" you step in quickly, have a quiet word with the staff, and manage to buy the strange little cake at a discount.",
  "DatingCharacterEvent.141302.3": "\"How can they say this is a failed attempt? Look at that perfect curve, that artistic line—they just don't know how to appreciate true beauty!\"\n\nChixia, clearly feeling words aren't enough, pulls out brush and paper on the spot and draws a picture of the little cake right then and there.\n\nIt's surprisingly realistic, but she looks truly happy while doing it.",
  "DatingCharacterEvent.141302.5": "Cake Artistry",
  "DatingCharacterEvent.141302.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.141302.7": "In the end, Chixia shared the crooked little cake with you, savoring each bite while lamenting that the world now had one less piece of edible art.\n\nHer cake drawing somehow ended up inside your backpack. You have no idea when she slipped it in.",
  "DatingCharacterEvent.1414.1": "Feeling a bit hungry, you and ==DATING_CHARACTER== decide to grab some food from the cafeteria.",
  "DatingCharacterEvent.1414.2": "The menu is packed with choices and you don't know where to start. After some indecision, you end up ordering the same thing as ==DATING_CHARACTER==.",
  "DatingCharacterEvent.1414.3": "The academy food isn't exactly gourmet, but it's not as bad as you imagined. You finish a simple meal together.",
  "DatingCharacterEvent.1415.1": "Feeling a bit hungry, you and ==DATING_CHARACTER== decide to grab some food from the cafeteria.",
  "DatingCharacterEvent.1415.2": "As you sit down with your orders, a couple at the next table leans in close. Please, not in public...!",
  "DatingCharacterEvent.1415.3": "But your prayer goes unheard. They kiss anyway. ==DATING_CHARACTER== notices too. She blushes, glances at you, then quickly looks away.",
  "DatingCharacterEvent.1416.1": "You and ==DATING_CHARACTER== head to the Academy library. Perhaps you'll find something interesting here?",
  "DatingCharacterEvent.1416.2": "Almost immediately, the comic book section draws your attention. Each of you grabs one.",
  "DatingCharacterEvent.1416.3": "The stories are hilarious, but you struggle not to laugh out loud in the quiet library. Sharing stifled giggles, you nearly run out of breath.",
  "DatingCharacterEvent.1417.1": "You and ==DATING_CHARACTER== head to the Academy library. Perhaps you'll find something interesting here?",
  "DatingCharacterEvent.1417.2": "You discover an old manuscript recording Stellaroid sightings. Holding one side each, you read together.",
  "DatingCharacterEvent.1417.3": "The two of you quietly discuss unknown Stellaroids and ancient variants. You are fascinated by what you learn.",
  "DatingCharacterEvent.142301.1": "You order a slice of durian cake, and when it arrives,\n\nCosette hesitates, staring at it nervously.\n\nUnfamiliar foods still make her uneasy.",
  "DatingCharacterEvent.142301.2": "\"Is it Okay for me to eat these?\"\n\nShe seems to be murmuring to herself.\n\nSensing her hesitation, you pick up your knife and fork—using your actions to show Cosette that it's perfectly fine to dig in.",
  "DatingCharacterEvent.142301.3": "She picks up her utensils a little awkwardly.\n\nWith each bite in silence, her movements grow faster.\n\nNow her plate is empty, but her face is full of satisfaction and pleasurable surprise.\n\n\"How about we order some more?\"\n\nShe nods shyly in agreement.",
  "DatingCharacterEvent.142301.5": "New Food Discovery",
  "DatingCharacterEvent.142301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.142301.7": "You and Cosette were enjoying desserts at the dessert shop.\n\nShe had never seen such unusual delicacies before.\n\nWith your encouragement, she mustered the courage to give them a try.\n\nJudging by her reaction, it was clear she's a fan of sweets.",
  "DatingCharacterEvent.142302.1": "The array of goods is dazzling to the eye, and there are some Artifacts that you have never seen before.\n\nCosette stops in front of a small stall.",
  "DatingCharacterEvent.142302.2": "The stall owner, noticing potential customers, eagerly begins showcasing their goods.\n\nCosette's eyes land on a small trinket.\n\nShe says nothing but lightly tugs at your sleeve, glancing at you with uncertainty in her eyes.",
  "DatingCharacterEvent.142302.3": "You know the prices here are inflated, but the hopeful look in her eyes doesn't leave you the room to hesitate.\n\n\"A gift for you,\" you say.\n\nShe beams with joy and nods at you.\n\n\"I want to ... see more...\"",
  "DatingCharacterEvent.142302.5": "The Lure of the Bling-Bling",
  "DatingCharacterEvent.142302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.142302.7": "You explored the bustling market with Cosette. It was an unfamiliar environment for her.\n\nShe fell in love with a trinket at a stall.\n\nEven though it was a bit overpriced, you bought it for her as a gift.",
  "DatingCharacterEvent.144301.1": "Chitose stands silently at the bow, moonlight spilling over her hair. Does the night coast make her homesick?",
  "DatingCharacterEvent.144301.2": "\"Do you ever think of returning to Goodwind?\"\n\n\"I shan't return until I become a true blade.\"\n\nYou chat idly for a long while.",
  "DatingCharacterEvent.144301.3": "The past always catches up, and changes the upcoming future. But before then, you need to help her to find herself as a person.",
  "DatingCharacterEvent.144301.5": "Port Talk",
  "DatingCharacterEvent.144301.6": "Visit the Port to unlock",
  "DatingCharacterEvent.144301.7": "Talking with Chitose on a small boat near the coast, you realized you still had a long way to go before becoming a true wielder. The jade-like blade by her side accompanied her travels, always reflecting back to her a sky veiled in shadows.",
  "DatingCharacterEvent.144302.1": "Chitose probably hasn't eaten many desserts like this, so you take the chance to order more.",
  "DatingCharacterEvent.144302.2": "When the next round of sweets arrives, she looks excited but doesn't dig in.\n\nIs she afraid of gaining weight? Unlikely. That's not something she'd care about.",
  "DatingCharacterEvent.144302.3": "You suddenly understand and say a little more seriously, \"Even a blade needs to be cared for.\" You slide a piece of cake toward her.\n\n\"If it's kept under constant strain, even the finest sword will eventually grow weary, even break.\"\n\nAt last, Chitose sets aside her concern and enjoys the treat together with you.",
  "DatingCharacterEvent.144302.5": "A Sugar-Tempered Blade",
  "DatingCharacterEvent.144302.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.144302.7": "At the dessert shop with Chitose, she said she didn't deserve such fine treatment, but you got her to see it differently.\n\n\"I do not care for such indulgence,\" she said—yet all afternoon, she had been smiling.",
  "DatingCharacterEvent.147301.1": "On the wide bay, Caramel sees a perfect \"stage.\"",
  "DatingCharacterEvent.147301.2": "She begins to play an enchanting melody, and you are captivated by the ethereal echoes resonating above the waves.",
  "DatingCharacterEvent.147301.3": "Having finished her performance, she bows to you with heartfelt satisfaction.",
  "DatingCharacterEvent.147301.5": "Secret Stage",
  "DatingCharacterEvent.147301.6": "Visit the Port to unlock",
  "DatingCharacterEvent.147301.7": "Together with Caramel, you discovered a spot at sea that was perfect for a stage.\n\nFor once, you enjoyed a complete, uninterrupted concert—one meant just for you. You couldn't help but look forward to the next time...",
  "DatingCharacterEvent.147302.1": "The array of goods is dazzling to the eye, and there are some Artifacts that you have never seen before.\n\nCaramel stops in front of a small stall.",
  "DatingCharacterEvent.147302.2": "The stall owner, noticing potential customers, eagerly begins showcasing their goods.\n\nCaramel's eyes land on a rare and exquisite effects pedal—an Artifact that can transform the sound of a bass guitar.\n\nYes, she's already drooling all over it.",
  "DatingCharacterEvent.147302.3": "She reaches into her pockets—surprise surprise, she is out of money again. You pay it for her with a resigned chuckle.\n\n\"I can pay you back with a free performance, producer!\"\n\nShe seems determined to repay the favor with her talent.",
  "DatingCharacterEvent.147302.5": "Artistic Integrity",
  "DatingCharacterEvent.147302.6": "Visit the Market to unlock",
  "DatingCharacterEvent.147302.7": "Strolling the market with Caramel, she came across a rare find—an Artifact that functioned as effects pedal.\n\nAs she was short on coin, you paid for it, and she promised to repay the favor with a free performance.\n\nYou knew she would be willing to play for you whenever, wherever.",
  "DatingCharacterEvent.149301.1": "At the far end of the cave, you stumble upon an old abandoned camp. Before you can look closer, Gerie gently covers your eyes.",
  "DatingCharacterEvent.149301.2": "\"Boss, there are long-lost remains here. Please turn away, so you won't be frightened.\" She turns you around with her other hand. \"Please wait a moment and let me grant the unfortunate their final peace.\"",
  "DatingCharacterEvent.149301.3": "You hear the sound of a shovel against stone, then silence. After a long while, Gerie softly takes your hand and leads you away from the cave's depths.",
  "DatingCharacterEvent.149301.5": "The Cave Mass",
  "DatingCharacterEvent.149301.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.149301.7": "You and Gerie discovered the long-forgotten remains of dead adventurers inside the cave.\n\nShe laid them to rest with reverence. In the stillness, you felt her quiet faith.",
  "DatingCharacterEvent.149302.1": "A small boat drifts over the dark coastal waters. \"Actually, I often come out here alone.\" Gerie kneels inside the boat. The moonlight drapes her robe in a sacred glow that outshines the stars.",
  "DatingCharacterEvent.149302.2": "\"It's vast and calm here.\" She takes your hands. \"Please share this stillness with me and use it to measure your own nature.\"",
  "DatingCharacterEvent.149302.3": "Her eyes lower; you can almost feel her breath. Her gentle touch at your fingertips quiets you.\n\nIt feels as though your senses drift far above the sea, watching two hearts beat in rhythm with the tide.",
  "DatingCharacterEvent.149302.5": "Sea Prayer",
  "DatingCharacterEvent.149302.6": "Visit the Port to unlock",
  "DatingCharacterEvent.149302.7": "While sightseeing on a small boat near the coast with Gerie, you shared a quiet moment underneath the moonlight, breathing in each other's presence.\n\nYou exchanged heartfelt prayers; though the waves rolled restlessly in the night, your hearts remained calm.",
  "DatingCharacterEvent.150301.1": "Laru's captivated by the cake in front of her, standing still and deep in thought.",
  "DatingCharacterEvent.150301.2": "\"Have you ever wondered why there's no fry-flavored cake yet?\"\n\nLooking at the beautifully made cake, she thinks out loud.\n\n\"If a cake tasted like fries, or even just looked like fries, think how many curious customers they'd get!\"\n\nYou try picturing a fry cake, but all you can think of is regular mashed potatoes.",
  "DatingCharacterEvent.150301.3": "\"Or maybe cake-flavored fries? Who says fries have to be salty, anyway?\"\n\nLaru dashes off to find a store employee.\n\nLooks like she's serious about getting this fry-flavored cake for you... or maybe cake-flavored fries?",
  "DatingCharacterEvent.150301.5": "Fry-Flavored Cake",
  "DatingCharacterEvent.150301.6": "Visit the Dessert Shop to unlock",
  "DatingCharacterEvent.150301.7": "Laru tried to create a french-fries-flavored cake at the dessert shop, but the staff suspected the two of you were just making trouble, and in the end you were both thrown out.\n\nStill, Laru insisted that a fries-flavored cake—or a cake-flavored fries—was a brilliant idea. She was determined to make it for you to try.",
  "DatingCharacterEvent.150303.1": "You sit with Laru on a pier at the port. She casts her hook and says, \"You know, the port's actually the best place to fish.\"\n\nNo way! \"Tell me more,\" you listen to her attentively.",
  "DatingCharacterEvent.150303.2": "\"First, the waves in the port are calmer. Plus, with the townsfolk dumping household scraps into the port, the water becomes richer in nutrients, attracting aquatic life.\" Laru points toward a small fishing boat. \"See that? Boats returning to the port carry a strong fishy scent, which draws carnivorous fish near.\"",
  "DatingCharacterEvent.150303.3": "\"In the port, net fishing isn't allowed, which keeps the fish population steady. The fish here are also used to all kinds of sounds coming from the dock, so they won't be easily scared off.\" Laru explains confidently, and under her personal guidance, you end up with quite a bountiful catch.",
  "DatingCharacterEvent.150303.5": "Port Fishing Guide",
  "DatingCharacterEvent.150303.6": "Visit the Port to unlock",
  "DatingCharacterEvent.150303.7": "Fishing with Laru at the port, she shared her rich knowledge about the port's unique ecology and her brilliant hooking techniques.\n\nWith her guidance, the two of you enjoyed a plentiful catch.",
  "DatingCharacterEvent.155301.1": "You sit side by side with Shia in the stern of a small boat. Her hair, light as the breeze, drifts across your neck, sending a soft shiver through you. You catch a faint, subtle fragrance.",
  "DatingCharacterEvent.155301.2": "The sea reflects scattered starlight. Shia dips her legs into the gentle rise and fall of the tide, and you follow, letting your feet sink into the cool embrace. Shia wraps her arm around yours —a silent promise that you will not fall.",
  "DatingCharacterEvent.155301.3": "Amid the gentle rocking of the waves, you feel an unusual sense of calm. The starlight dances in Shia’s eyes. She blinks, then looks at you. For the first time, you see how clear and bright her gaze is—as if reflecting the sea and sky.",
  "DatingCharacterEvent.155301.5": "Cruise of Ripples",
  "DatingCharacterEvent.155301.6": "Visit the Port to unlock",
  "DatingCharacterEvent.155301.7": "You enjoy a calming, gentle time with Shia, sightseeing by boat at the port. Your legs dangle in the water, the waves lapping gently at your skin.\nYou seem to have finally caught a glimpse of what the \"scent\" she often talks about is—it is a complex sensation, slowly unfolding over the sea, much like the touch of her skin around your arm.",
  "DatingCharacterEvent.155302.1": "After some exploration, you discover a shallow underground river. Shia thinks for a moment, then says, \"I know where it flows.\" And so, you decide to take a drift.",
  "DatingCharacterEvent.155302.2": "The current is not strong, but the icy cold water makes you hesitant. Shia holds your hand tightly; she looks very excited. Guided by the drone's light, you drift slowly forward.",
  "DatingCharacterEvent.155302.3": "The water becomes wider and shallower, so you and Shia stop and decide to take a rest on the bank. She smiles, \"The feeling of the underground river is very different from the sea!\"",
  "DatingCharacterEvent.155302.5": "Underground Drift",
  "DatingCharacterEvent.155302.6": "Visit the Cave to unlock",
  "DatingCharacterEvent.155302.7": "You share a thrilling journey with Shia as you drift through the cave.\nThough it may seem dangerous, you realize that for Shia, any flowing water is easy to handle. You both have a lot of fun.",
  "DatingCharacterEvent.156301.1": "As soon as you reach the game stalls, Nazuna spots a row of claw machines. Before you've even located them, she challenges you to a competition.",
  "DatingCharacterEvent.156301.2": "She plays like a pro: coin in, prize out, smooth as can be.\n\nNow it's your turn against the machine, and she's watching.",
  "DatingCharacterEvent.156301.3": "You seize the right moment and smack the button with a snap.\n\n\"Got it!\" Nazuna slaps the claw machine at the same time, and the claw—thrown off by the interference—fails to catch anything, of course.\n\nNazuna doubles over with laughter, but she gives you all the prizes she won.",
  "DatingCharacterEvent.156301.5": "\"Lord of the Prize Claw\"",
  "DatingCharacterEvent.156301.6": "Visit the Market to unlock",
  "DatingCharacterEvent.156301.7": "At the market you compete with Nazuna at the claw machines. She finishes first and mischievously sabotages you, securing an easy victory.\n\nEven so, she gives you all the prizes she's won. It seems you've earned the recognition of the \"Lord of the Prize Claw.\"",
  "DatingCharacterEvent.156302.1": "You thought Nazuna would say no to your idea, but she agrees.",
  "DatingCharacterEvent.156302.2": "\"You know, fishing's kind of like claw machines,\" she says. \"Except with fishing, you wait more.\"",
  "DatingCharacterEvent.156302.3": "She sits motionless, so much that you wonder if she's fallen asleep.\n\nSuddenly the float bobs hard. She pulls fast—a small fish wriggles on the line.\n\n\"Hehehe~\" She waves it in your face. Meanwhile, you haven't caught a thing.",
  "DatingCharacterEvent.156302.5": "Seaside Fishing",
  "DatingCharacterEvent.156302.6": "Visit the Port to unlock",
  "DatingCharacterEvent.156302.7": "While fishing with Nazuna at the port, she said that fishing and claw machines share the same trick. Soon enough, she caught something.\n\nYou can't help but wonder: could fishing, like claw machines, also have some kind of hidden \"mechanical technique\"?",
  "DatingCharacterEvent.515.1": "In the innermost part of the cave, ==DATING_CHARACTER== discovers a massive shrine.",
  "DatingCharacterEvent.515.2": "In the very center of the shrine sits a massive projector artifact.",
  "DatingCharacterEvent.515.3": "Judging by the nearby wall paintings, it seems that those who worshiped here believed the image revealed by the artifact was that of a deity's.",
  "DatingCharacterEvent.516.1": "In the innermost part of the cave lies a massive abyss. It's circular in shape and seems bottomless.",
  "DatingCharacterEvent.516.2": "You and ==DATING_CHARACTER== stand side by side at the edge of the abyss, holding each other's hand tightly.",
  "DatingCharacterEvent.516.3": "Something at the bottom of the abyss seems to be staring at you, but you have no fear.",
  "DatingCharacterEvent.517.1": "You find a beautiful mushroom and pop it into your mouth. Then hallucinations overtake you. You feel lost in a forest and start running wildly in every direction.",
  "DatingCharacterEvent.517.2": "A fluffy bear cub hugs you tightly and doesn't let go until you come to your senses.",
  "DatingCharacterEvent.518.1": "You find an ordinary-looking mushroom. After tasting it, you find it delicious. Together, you sprinkle on some seasoning and roast it over the fire.",
  "DatingCharacterEvent.518.2": "The aroma of the roasted mushroom attracts a giant earth dragon, and that's how you end up with a new ingredient for your meal.",
  "DatingCharacterEvent.519.1": "You find an ugly-looking mushroom. It's incredibly bitter but also keeps you wide awake.",
  "DatingCharacterEvent.519.2": "And so, when the next rest comes, it's your turn to stand watch.",
  "DatingCharacterEvent.615.1": "\"Excuse me, would you two like to participate in our raffle?\" The enthusiastic shop assistant asks.",
  "DatingCharacterEvent.615.2": "You and ==DATING_CHARACTER== take a raffle ticket each.",
  "DatingCharacterEvent.615.3": "==DATING_CHARACTER== scores a BOGO coupon. She gets double portion for everything she orders.",
  "DatingCharacterEvent.616.1": "\"Excuse me, would you two like to participate in our raffle?\" The enthusiastic shop assistant asks.",
  "DatingCharacterEvent.616.2": "You and ==DATING_CHARACTER== take a raffle ticket each.",
  "DatingCharacterEvent.616.3": "Unlucky this time. Nothing useful. Better luck next time.",
  "DatingCharacterEvent.617.1": "The desserts are delicious, leaving you wanting more.",
  "DatingCharacterEvent.617.2": "Why not order some more? Make today a cheat day.",
  "DatingCharacterEvent.618.1": "Though the plates are empty, your conversation hasn't run out.",
  "DatingCharacterEvent.618.2": "The two of you chat about nothing in particular, the topic turn from Northern Isles to Lushwood Jungle...",
  "DatingCharacterEvent.714.1": "A furtive-looking man pushes past you and walks away briskly, nearly causing you to lose your balance.\n\n==DATING_CHARACTER== quickly grabs you, asking if you're hurt.",
  "DatingCharacterEvent.714.2": "You have a gut feeling that something's off about that person.\n\nThen, a shout of \"Stop, thief!\" rings out nearby, confirming your instincts.",
  "DatingCharacterEvent.714.3": "You and ==DATING_CHARACTER== split up. Despite the huge crowd, you two manage to catch the thief.\n\nThe bystanders cheer your brave act.",
  "DatingCharacterEvent.715.1": "A furtive-looking man pushes past you and walks away briskly, nearly causing you to lose your balance.\n\nYou quickly grab him by his arm because you sense something is off.",
  "DatingCharacterEvent.715.2": "A shout of \"Stop, thief!\" rings out nearby and you two react immediately.\n\n==DATING_CHARACTER== and you subdue the thief.",
  "DatingCharacterEvent.715.3": "After the commotion, ==DATING_CHARACTER== sighs and says that she hope you won't risk yourself like that next time.\n\nShe adds that in situations like this, it should be her protecting you.",
  "DatingCharacterEvent.716.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nAt the dart booth, you and ==DATING_CHARACTER== each grab five darts.",
  "DatingCharacterEvent.716.2": "The first four darts almost hit the bullseye. You can't help but feel a bit nervous as you get ready to throw the last one.\n\n==DATING_CHARACTER== leans in and whispers softly, \"Good luck.\"",
  "DatingCharacterEvent.716.3": "With a bag full of prizes in hand, the two of you continue exploring the market happily.",
  "DatingCharacterEvent.717.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nAt the ring toss booth, you and ==DATING_CHARACTER== each grab five rings.",
  "DatingCharacterEvent.717.2": "You are on fire and bag four prizes.\n\n==DATING_CHARACTER== stands next to you and applauds.",
  "DatingCharacterEvent.717.3": "With a bag full of prizes in hand, the two of you continue exploring the market happily.",
  "DatingCharacterEvent.718.1": "You decide to try your luck at the market's game area because every participant gets a chance at a raffle.\n\nThe whack-a-mole stall is packed with people; you and ==DATING_CHARACTER== each buy enough tokens for two rounds of the game.",
  "DatingCharacterEvent.718.2": "You lift the mallet and manage to hit almost every mole that pops up.\n\nAfter the game ends, ==DATING_CHARACTER== gently massages your sore arm.",
  "DatingCharacterEvent.718.3": "With a bag full of prizes in hand, the two of you continue exploring the market happily.",
  "DatingCharacterEvent.719.1": "Suddenly, a burst of excitement erupts from the crowd in a distance.\n\nA street performance has begun.",
  "DatingCharacterEvent.719.2": "The impromptu acrobatics performance draws gasps of amazement from the crowd. Both of you feel that you definitely came to the right place today.",
  "DatingCharacterEvent.719.3": "The show ends to roaring applause.\n\nYou look over at ==DATING_CHARACTER==; she's smiling just like you, a smile that comes from the heart.",
  "DatingCharacterEvent.720.1": "Suddenly, a burst of excitement erupts from the crowd in a distance, followed by the sound of lively music.\n\nA street performance has begun.",
  "DatingCharacterEvent.720.2": "Even though the stage is a makeshift one, the idols from Scarlet Sights Media give their all. Their dance moves and vocals are full of energy.\n\n==DATING_CHARACTER==, caught up in the mood and rhythm, starts swaying her hand to the beat without even realizing it.",
  "DatingCharacterEvent.720.3": "Even after the final song ends, ==DATING_CHARACTER== still seems to want more.\n\nThe two of you exchange a cheerful smile.",
  "DatingCharacterEvent.721.1": "Suddenly, a burst of excitement erupts from the crowd in a distance, followed by music.\n\nA street performance has begun.",
  "DatingCharacterEvent.721.2": "The spotlight is on an unknown singer.\n\nSong after song, the energy in the crowd builds. Everyone is amazed by that incredible voice.",
  "DatingCharacterEvent.721.3": "You stay to the very end.\n\n==DATING_CHARACTER== slips you some Dorra, nudging you to give the singer a tip.",
  "DatingCharacterEvent.722.1": "At the edge of the market, there's a shop selling stylish trinkets.",
  "DatingCharacterEvent.722.2": "==DATING_CHARACTER== has her eyes on the glowing ink, and the invisible kind that only shows up when it's touched with water.",
  "DatingCharacterEvent.722.3": "In the end, she buys a small bottle of gradient-colored ink.",
  "DatingCharacterEvent.723.1": "In one corner of the market, there is a pickled food stall.",
  "DatingCharacterEvent.723.2": "A massive salted fish hangs at the entrance of the shop. No one knows how long it has been there or when it was cured.",
  "DatingCharacterEvent.723.3": "Regardless, nothing can spoil it, not even the most virtuous souls.",
  "DatingCharacterEvent.814.1": "You sit together at the docks and lower fishing lines into the sea.",
  "DatingCharacterEvent.814.2": "You chat idly as you wait. The tide rises, but no fish bite. You wait anyway, until there's nothing left to wait for.",
  "DatingCharacterEvent.814.3": "Not a single catch, but the time spent talking is more than enough. Fishing is less about the catch, and more about the waiting.",
  "DatingCharacterEvent.815.1": "You sit together at the docks and lower fishing lines into the sea.",
  "DatingCharacterEvent.815.2": "As you chat idly, suddenly the line jerks hard, pulling at the rod. The force feels immense and you scramble to reel it in.",
  "DatingCharacterEvent.815.3": "When the fight eases, the two of you haul it up together. It's gigantic!\n\nBut you don't know what to do with it, so you take a photo and let it go.",
  "DatingCharacterEvent.816.1": "The two of you lie back on the rocking boat, gazing at the Divine Window, trading stories of the day.",
  "DatingCharacterEvent.816.2": "==DATING_CHARACTER=='s words grow fragmented, her breathing steady—she's fallen asleep.",
  "DatingCharacterEvent.816.3": "When the boat docks, you wake her gently and help her ashore.",
  "DatingCharacterEvent.817.1": "You sit together on the boat as moonlight shimmers across the bay.",
  "DatingCharacterEvent.817.2": "Swept up by the moment, ==DATING_CHARACTER== begins to sing softly.",
  "DatingCharacterEvent.817.3": "You listen in silence. In the boat, surrounded by the darkness, every sound feels amplified. You can hear the waves become her accompaniment, and distant whales seem to join in.\n\nA breeze rises, carrying strands of her hair across your cheek."
}