{
  "Plot.10301.1": "The Lost Kitten, Part I",
  "Plot.10301.2": "A single \"hunt,\" one unfortunate mistake, and a pair of innocent eyes.",
  "Plot.10302.1": "The Lost Kitten, Part II",
  "Plot.10302.2": "A grand adventure with you, a girl, and a cat.",
  "Plot.10303.1": "The Lost Kitten, Part III",
  "Plot.10303.2": "Words spoken from the heart, and a promise made.",
  "Plot.10701.1": "Masked Knight Tilia! Part I",
  "Plot.10701.2": "Crisis looms! Storms never cease.",
  "Plot.10702.1": "Masked Knight Tilia! Part II",
  "Plot.10702.2": "The heart of justice awakens! A knight who hunts giants.",
  "Plot.10703.1": "Masked Knight Tilia!, Part III",
  "Plot.10703.2": "Friendship and bonds! The hero returns riding Falcon.",
  "Plot.10801.1": "Lucky Day, Part I",
  "Plot.10801.2": "A lost lucky charm? Nothing is more important than that!",
  "Plot.10802.1": "Lucky Day, Part II",
  "Plot.10802.2": "Where shall a new lucky charm be found? Out in the Wilds? Or in a fortune cookie shop?",
  "Plot.10803.1": "Lucky Day, Part III",
  "Plot.10803.2": "Run, Boss! Run if you wanna keep your shoes!",
  "Plot.11001.1": "???",
  "Plot.11001.2": "???",
  "Plot.11002.1": "???",
  "Plot.11002.2": "???",
  "Plot.11003.1": "???",
  "Plot.11003.2": "???",
  "Plot.11101.1": "The Shopping War, Part I",
  "Plot.11101.2": "Oh no! Everything's on the line! Iris's future must be saved!",
  "Plot.11102.1": "The Shopping War, Part II",
  "Plot.11102.2": "Time is life! Speed means survival! There is no time to hesitate! Every second counts!",
  "Plot.11103.1": "The Shopping War, Part III",
  "Plot.11103.2": "Leave your worries and gloom behind—lose yourself in the sweet scent of butter and sugar.",
  "Plot.11201.1": "Fast and Focused, Part I",
  "Plot.11201.2": "Having successfully modified Loxy, Noya warmly invites you to join her for a \"relaxing\" joyride.",
  "Plot.11202.1": "Fast and Focused, Part II",
  "Plot.11202.2": "Her wild driving quickly makes you fear for your life. And sure enough, your worst fears start to come true...",
  "Plot.11203.1": "Fast and Focused, Part III",
  "Plot.11203.2": "You get caught in a tense, high-speed chase against street racers. In a critical moment, Noya makes her choice...",
  "Plot.11301.1": "Hot Pot Buddies, Part I",
  "Plot.11301.2": "Commission From Shimiao: Case investigation... Wait, why does this sound dangerous?",
  "Plot.11302.1": "Hot Pot Buddies, Part II",
  "Plot.11302.2": "The first step in solving the case: retrace the steps of the Xuan Shi group!",
  "Plot.11303.1": "Hot Pot Buddies, Part II",
  "Plot.11303.2": "The truth comes to light... But a new commission appears?!",
  "Plot.11401.1": "???",
  "Plot.11401.2": "???",
  "Plot.11402.1": "???",
  "Plot.11402.2": "???",
  "Plot.11403.1": "???",
  "Plot.11403.2": "???",
  "Plot.11501.1": "???",
  "Plot.11501.2": "???",
  "Plot.11502.1": "???",
  "Plot.11502.2": "???",
  "Plot.11503.1": "???",
  "Plot.11503.2": "???",
  "Plot.11601.1": "Atypical Greenhouse, Part I",
  "Plot.11601.2": "You are invited to Ridge's greenhouse, but wait ... is it really just a greenhouse?",
  "Plot.11602.1": "Atypical Greenhouse, Part II",
  "Plot.11602.2": "You and Ridge caught a few food thieves. What? They did it out of necessity?",
  "Plot.11603.1": "Atypical Greenhouse, Part III",
  "Plot.11603.2": "The peas are thriving with Ridge's boost, but ... aren't they a little too big now? Oh no, the pea plants are eating people!",
  "Plot.11701.1": "Candy Hidden within the Promise, Part I",
  "Plot.11701.2": "\"The place in front of you is the most popular restaurant in all of Philae!\"—says the little manager proudly, her tail wagging.",
  "Plot.11702.1": "Candy Hidden within the Promise, Part II",
  "Plot.11702.2": "Beat a Loong master at mahjong? That challenge should be a piece of cake for the Boss!",
  "Plot.11703.1": "Candy Hidden within the Promise, Part III",
  "Plot.11703.2": "\"Thank you... For sticking with someone childish like me~\"",
  "Plot.11801.1": "Bones Obsession, Part I",
  "Plot.11801.2": "The guild arrived at Coronis' clinic to confirm whether the Boss's sickness truly is terminal. From the expression on the three's faces, you realize your life is about to come to an end...",
  "Plot.11802.1": "Bones Obsession, Part II",
  "Plot.11802.2": "As you stay and rest, you witness Coronis' superior medical practice techniques. Would a doctor with such skills be able to cheat death...?",
  "Plot.11803.1": "Bones Obsession, Part III",
  "Plot.11803.2": "When you were discharged, Coronis bestowed upon you her treasured specimen.",
  "Plot.11901.1": "The Maid's Secret Mission, Part I",
  "Plot.11901.2": "Maid's Mission One: Share Sweetness.",
  "Plot.11902.1": "The Maid's Secret Mission, Part II",
  "Plot.11902.2": "Maid's Mission Two: Win the Grand Prize.",
  "Plot.11903.1": "The Maid's Secret Mission, Part III",
  "Plot.11903.2": "Maid's Mission Three: ...Mission? What Mission!",
  "Plot.12001.1": "After-Class Paper Writing, Part I",
  "Plot.12001.2": "Nobody's told me that freelance Trekkers need to write papers!",
  "Plot.12002.1": "After-Class Paper Writing, Part II",
  "Plot.12002.2": "Unexpected! Unforeseen! A sudden visit!",
  "Plot.12003.1": "After-Class Paper Writing, Part III",
  "Plot.12003.2": "Does anyone still remember that we came here to write a paper!",
  "Plot.12301.1": "The Sleepless Guardian, Part I",
  "Plot.12301.2": "There's no age requirement for being a forest guardian.",
  "Plot.12302.1": "The Sleepless Little Guardian, Part II",
  "Plot.12302.2": "Trap handling, medicine grinding, wound treatment, animal communication... Don't be surprised—these are all required skills.",
  "Plot.12303.1": "The Sleepless Guardian, Part III",
  "Plot.12303.2": "When something doesn't make sense, get some sleep first. One day, you'll understand.",
  "Plot.12501.1": "A Bonding Duel, Part I",
  "Plot.12501.2": "What does it take to become a Special Delivery Person at Post Haste?",
  "Plot.12502.1": "A Bonding Duel, Part II",
  "Plot.12502.2": "When the girl swings her great axe, the earth itself trembles.",
  "Plot.12503.1": "A Bonding Duel, Part III",
  "Plot.12503.2": "This time, the one standing across the ring is you.",
  "Plot.12601.1": "Miss Butterfly, Part I",
  "Plot.12601.2": "The grand stage of the Magician Maximus—today, you're the guest of honor.",
  "Plot.12602.1": "Miss Butterfly, Part II",
  "Plot.12602.2": "A chance to be a big star's personal assistant—better make the most of it.",
  "Plot.12603.1": "Miss Butterfly, Part III",
  "Plot.12603.2": "When the spotlight fades, she reveals the true secrets behind her \"magic.\"",
  "Plot.12701.1": "The Nimble yet Unbreakable Messenger, Part I",
  "Plot.12701.2": "They say that if you always walk by the water, your shoes are bound to get wet, but even so...",
  "Plot.12702.1": "The Nimble yet Unbreakable Messenger, Part II",
  "Plot.12702.2": "Some people just have ... very strange talents.",
  "Plot.12703.1": "The Nimble yet Unbreakable Messenger, Part III",
  "Plot.12703.2": "A band-aid can hide the wound, but not the fact that you were hurt.",
  "Plot.13001.1": "???",
  "Plot.13001.2": "???",
  "Plot.13002.1": "???",
  "Plot.13002.2": "???",
  "Plot.13003.1": "???",
  "Plot.13003.2": "???",
  "Plot.13201.1": "A Delinquent's Day, Part I",
  "Plot.13201.2": "Throwing down over honor and turf is just another day's work for a \"delinquent girl.\"",
  "Plot.13202.1": "A Delinquent's Day, Part II",
  "Plot.13202.2": "The battlefield of pen and paper is the delinquent girl's voluntary overtime.",
  "Plot.13203.1": "A Delinquent's Day, Part III",
  "Plot.13203.2": "Bombs! More bombs! Phantom Bomb Rider are her secret hobby.",
  "Plot.13301.1": "???",
  "Plot.13301.2": "???",
  "Plot.13302.1": "???",
  "Plot.13302.2": "???",
  "Plot.13303.1": "???",
  "Plot.13303.2": "???",
  "Plot.13401.1": "First Snow（Part I）",
  "Plot.13401.2": "The adventures have come to a temporary end. Growth has brought on new troubles. You and the timid white-haired girl reunite once again as Philae is slowly covered in snow.",
  "Plot.13402.1": "First Snow（Part II）",
  "Plot.13402.2": "Her efforts may be clumsy, but they're sincere. And the change is happening before anyone realizes it.",
  "Plot.13403.1": "First Snow（Part III）",
  "Plot.13403.2": "She speaks on the stage to say farewell to her past. With your help and care, she rediscovers her true self.",
  "Plot.13501.1": "A Special Report, Part I",
  "Plot.13501.2": "Sensing a gaze on you, you turn around to find the Witch sneaking closer—as it turns out, she's plotting a big scoop!",
  "Plot.13502.1": "A Special Report, Part II",
  "Plot.13502.2": "The Boss and the Witch arrange a private, up-close interview, only for a mysterious thug to crash the scene!",
  "Plot.13503.1": "A Special Report, Part III",
  "Plot.13503.2": "After an honest heart-to-heart with the Witch, their most guarded secret is about to be revealed!",
  "Plot.14101.1": "The Haunted Village, Part I",
  "Plot.14101.2": "Spooky things continue to happen in the wilderness outside the city. There are suspicions of areas being \"haunted.\" The cowardly Xuan Shi is tasked with the incident... With only one step into the village, Xuan Shi began to scream frantically—",
  "Plot.14102.1": "The Haunted Village, Part II",
  "Plot.14102.2": "Does the old diary's record of that unfinished wedding contain a trace of regret? A shadow flickers—could it really be a ghost?",
  "Plot.14103.1": "The Haunted Village, Part III",
  "Plot.14103.2": "Are the secrets veiled by night the doings of \"ghosts\" or simply humans? As the candlelight flickers, it points to what took place beneath the red silk.",
  "Plot.14201.1": "The \"Date\", Part I",
  "Plot.14201.2": "Supposedly a date invitation ... But there's no way it's a normal date, right!?",
  "Plot.14202.1": "The \"Date\", Part II",
  "Plot.14202.2": "Always remember the main goal of this \"date\" is to gather intel... Huh?? What drink?!",
  "Plot.14203.1": "The \"Date\", Part III",
  "Plot.14203.2": "This \"date\" is actually kinda fun... Oh no! I forgot all about the mission!",
  "Plot.14301.1": "???",
  "Plot.14301.2": "???",
  "Plot.14302.1": "???",
  "Plot.14302.2": "???",
  "Plot.14303.1": "???",
  "Plot.14303.2": "???",
  "Plot.14401.1": "Training for Oneness, Part I",
  "Plot.14401.2": "You ran into Chitose on the street, and the two of you started talking about how to achieve the state of Oneness...",
  "Plot.14402.1": "Training for Oneness, Part II",
  "Plot.14402.2": "They say if you hold your breath, focus, and gaze into each other's eyes, your hearts will connect... But for two people who are always out of sync, can it really work?",
  "Plot.14403.1": "Training for Oneness, Part III",
  "Plot.14403.2": "The rain poured down, and she seemed a little dejected. In that moment, you realized the duty you must fulfill as the \"Wielder...\"",
  "Plot.14501.1": "???",
  "Plot.14501.2": "???",
  "Plot.14502.1": "???",
  "Plot.14502.2": "???",
  "Plot.14503.1": "???",
  "Plot.14503.2": "???",
  "Plot.14701.1": "Echo of Hearts and Stars, Part I",
  "Plot.14701.2": "Given the task of \"healing the trauma of war-ridden Trekkers,\" a troubled Boss unexpectedly hears a familiar melody in Flavio...",
  "Plot.14702.1": "Echo of Hearts and Stars, Part II",
  "Plot.14702.2": "Caramel asks you to become her personal producer. You think of a great way for her to get inspired...",
  "Plot.14703.1": "Echo of Hearts and Stars, Part III",
  "Plot.14703.2": "At the Trekker Camp beneath the Monolith, you and Caramel step on the stage. Flavio's next legend is about to be born...",
  "Plot.14901.1": "Collar and Rope, Part I",
  "Plot.14901.2": "An unbreakable cursed bond. An unforeseen reunion.",
  "Plot.14902.1": "Collar and Rope, Part II",
  "Plot.14902.2": "What terrible secrets lie behind those wild, cynical eyes?",
  "Plot.14903.1": "Collar and Rope, Part III",
  "Plot.14903.2": "The reins of fate have been placed in your hands—you are destined to tame the ravenous beast before you.",
  "Plot.15001.1": "The Great Fry-tastrophe, Part I",
  "Plot.15001.2": "No work talk while fishing on company time! But if you catch a fish, Laru will hear you out~",
  "Plot.15002.1": "The Great Fry-tastrophe, Part II",
  "Plot.15002.2": "Even if you only catch a strand of weed, it still counts as a catch—but you said fries, what fries?!",
  "Plot.15003.1": "The Great Fry-tastrophe, Part III",
  "Plot.15003.2": "At this point, Laru's future is in your hands...!",
  "Plot.15501.1": "The Nostalgic Scent, Part I",
  "Plot.15501.2": "A scent adrift on the sea breeze, stirring memories.",
  "Plot.15502.1": "The Nostalgic Scent, Part II",
  "Plot.15502.2": "A scent lingering in the old alleys, long since vanished.",
  "Plot.15503.1": "The Nostalgic Scent, Part III",
  "Plot.15503.2": "A scent clinging to your back, constant and unchanging.",
  "Plot.15601.1": "Big Cleanup Job in a Small Room, Part I",
  "Plot.15601.2": "Death K has delivered the final verdict, the end draws near. And then—that person appeared.",
  "Plot.15602.1": "Big Cleanup Job in a Small Room, Part II",
  "Plot.15602.2": "Even with eyes clouded by desire and a soul worn down by time, they never stopped moving forward.",
  "Plot.15603.1": "Big Cleanup Job in a Small Room, Part III",
  "Plot.15603.2": "The crisis was averted. Following those footsteps, her adventure had only just begun.",
  "Plot.15901.1": "???",
  "Plot.15901.2": "???",
  "Plot.15902.1": "???",
  "Plot.15902.2": "???",
  "Plot.15903.1": "???",
  "Plot.15903.2": "???"
}