{
  "TourGuideQuest.1001.1": "Clear Misstep On One in Ascension once",
  "TourGuideQuest.1002.1": "Clear Basic Trial: Difficulty 1",
  "TourGuideQuest.1003.1": "Upgrade 1 Trekker to Lv. 10",
  "TourGuideQuest.1004.1": "Clear Element Monolith in Ascension once",
  "TourGuideQuest.2001.1": "Clear 1 Difficulty 1 Trial with max stars in Tier-up Trial",
  "TourGuideQuest.2002.1": "Upgrade 2 Trekkers to Tier 1",
  "TourGuideQuest.2003.1": "Clear Infinite Arena: Difficulty 1 in the Menace Arena",
  "TourGuideQuest.2004.1": "Upgrade any 1 Disc to Tier 1",
  "TourGuideQuest.3001.1": "Clear Main Story Chapter 1",
  "TourGuideQuest.3002.1": "Upgrade any 3 Trekkers to Tier 1 or above",
  "TourGuideQuest.3003.1": "Upgrade any 3 Discs to Tier 1 or above",
  "TourGuideQuest.3004.1": "Upgrade any 6 combat skills to Lv. 2 or above",
  "TourGuideQuest.3005.1": "Light up Key to the Stairs to the Stars in Monolith Research",
  "TourGuideQuest.3006.1": "Clear Monolith through Monolith Stairs Pass once",
  "TourGuideQuest.3007.1": "Collect a total of 30 Potentials in Monolith Log",
  "TourGuideQuest.3008.1": "Collect a total of 5 Anecdotal Notes in Monolith Log",
  "TourGuideQuest.3009.1": "Light up Honor at the Finish Line in Monolith Research",
  "TourGuideQuest.3010.1": "Use the Enhancement Machine 1 time in the Monolith",
  "TourGuideQuest.4001.1": "Clear Main Story Chapter 2",
  "TourGuideQuest.4002.1": "Upgrade any 4 Trekkers to Tier 2 or above",
  "TourGuideQuest.4003.1": "Upgrade any 5 Discs to Tier 2 or above",
  "TourGuideQuest.4004.1": "Upgrade any 4 combat skills to Lv. 3 or above",
  "TourGuideQuest.4005.1": "Light up Destiny's Choice in Monolith Research",
  "TourGuideQuest.4006.1": "Collect a total of 15 Anecdotal Notes in Monolith Log",
  "TourGuideQuest.4007.1": "Use the Enhancement Machine 6 times in the Monolith",
  "TourGuideQuest.4008.1": "Collect a total of 50 Potentials in Monolith Log",
  "TourGuideQuest.4009.1": "Clear 3 Difficulty 2 Trials with max stars in Tier-up Trial",
  "TourGuideQuest.4010.1": "Clear Basic Trial: Difficulty 2 with max stars",
  "TourGuideQuest.4011.1": "Clear 2 different arenas on Difficulty 2 in Menace Arena",
  "TourGuideQuest.5001.1": "Clear 3 Difficulty 3 Trials with max stars in Tier-up Trial",
  "TourGuideQuest.5002.1": "Clear Basic Trial: Difficulty 3 with max stars",
  "TourGuideQuest.5003.1": "Upgrade any 6 Trekkers to Tier 3 or above",
  "TourGuideQuest.5004.1": "Upgrade any 5 Discs to Tier 3 or above",
  "TourGuideQuest.5005.1": "Upgrade any 6 combat skills to Lv. 3 or above",
  "TourGuideQuest.5006.1": "Clear any 2 arenas on Difficulty 3 in the Menace Arena",
  "TourGuideQuest.5007.1": "Clear Cataclysm Survivor stage: Port Defense II",
  "TourGuideQuest.6001.1": "Clear 3 Difficulty 4 Trials with max stars in Tier-up Trial",
  "TourGuideQuest.6002.1": "Upgrade any 3 Trekkers to Tier 4 or above",
  "TourGuideQuest.6003.1": "Upgrade any 5 Discs to Tier 4 or above",
  "TourGuideQuest.6004.1": "Upgrade any 12 combat skills to Lv. 3 or above",
  "TourGuideQuest.6005.1": "Clear any 2 arenas on Difficulty 4 in the Menace Arena",
  "TourGuideQuest.6006.1": "Clear Cataclysm Survivor stage: Port Defense IV",
  "TourGuideQuest.7001.1": "Clear Basic Trial: Difficulty 4 with max stars",
  "TourGuideQuest.7002.1": "Upgrade any 4 Trekkers to Tier 5 or above",
  "TourGuideQuest.7003.1": "Upgrade any 5 Discs to Tier 5 or above",
  "TourGuideQuest.7004.1": "Upgrade any 6 combat skills to Lv. 4 or above",
  "TourGuideQuest.7005.1": "Clear 3 Difficulty 1 Trials with max stars in Proving Grounds",
  "TourGuideQuest.7006.1": "Clear any 2 arenas in Arena 5 on Difficulty 5 in the Menace Arena",
  "TourGuideQuest.8001.1": "Upgrade any 6 Trekkers to Tier 5 or above",
  "TourGuideQuest.8002.1": "Upgrade any 8 Discs to Tier 5 or above",
  "TourGuideQuest.8003.1": "Upgrade any 12 combat skills to Lv. 4 or above",
  "TourGuideQuest.8004.1": "Clear any 2 arenas on Difficulty 5 in the Menace Arena",
  "TourGuideQuest.8005.1": "Complete 1 battle in Emblem Trial",
  "TourGuideQuest.8006.1": "Clear Cataclysm Survivor stage: Port Defense VI",
  "TourGuideQuest.9001.1": "Upgrade any 6 Trekkers to Tier 6 or above",
  "TourGuideQuest.9002.1": "Upgrade any 8 Discs to Tier 6 or above",
  "TourGuideQuest.9003.1": "Upgrade any 12 combat skills to Lv. 5 or above",
  "TourGuideQuest.9004.1": "Clear any 2 arenas in Arena 5 on Difficulty 6 in the Menace Arena",
  "TourGuideQuest.9005.1": "Clear Cataclysm Survivor stage: Monster Surge"
}