{
  "Story.100.1": "孤児院への道のり",
  "Story.100.2": "些細な誤解がきっかけで、セイナたち空白旅団は戦うことを余儀なくされてしまい――",
  "Story.100.4": "BT01",
  "Story.101.1": "夢の終わり",
  "Story.101.2": "祈願箱の中で眠っていた謎の人物を連れて、セイナたち空白旅団はひとまず近郊の都市・アモールへ帰ることにした。道中、眠ってしまった謎の人物は夢を見るのだが――",
  "Story.101.4": "01",
  "Story.102.1": "過去の痕跡",
  "Story.102.2": "所用を済ませてから、ノヴァ大陸のライフラインを一手に担う巨大なカンパニー『恩恵意志』の運営する『心相ショップ』を訪れる空白旅団。目的は謎の人物の身元特定だったのだが――",
  "Story.102.4": "02",
  "Story.103.1": "消えたオアシス",
  "Story.103.2": "結局、謎の人物の身元は特定できないばかりかさらに謎が深まってしまった。心相石ショップの貸金庫で困惑するセイナたちのもとへ、さらにショッキングな知らせがもたらされ――",
  "Story.103.4": "03",
  "Story.104.1": "橋の下",
  "Story.104.2": "白亜商会の代表執行官・フィキンによって、拠点としても使っていたワゴン『オアシス号』を奪われたうえに借金まで負うことになってしまった空白旅団は、水道橋の下で途方に暮れていた――",
  "Story.104.4": "04",
  "Story.105.1": "アッシュエリアの風",
  "Story.105.2": "気を取り直して、元の目的地である孤児院『ヒナギクの家』へ向かうことにしたセイナたち空白旅団。行き倒れの少女を介抱した後、ヒナギクの家があるアッシュエリアへ赴くが――",
  "Story.105.4": "05",
  "Story.106.1": "飛ぶことを選んだ",
  "Story.106.2": "この地域を縄張りとするギャング『ウィンドアッシュ』。その総長ミネルバはかなりの実力者で、空白旅団は苦戦を強いられてしまうのだが――",
  "Story.106.4": "06",
  "Story.107.1": "別々の願い",
  "Story.107.2": "誤解が解け、ミネルバたちウィンドアッシュと力を合わせることにした空白旅団。相談の結果、状況を好転させるため、フィキン率いる白亜商会に潜り込むことにするが――",
  "Story.107.4": "07",
  "Story.108.1": "調査結果",
  "Story.108.2": "フィキンに騙され雇用契約を結んでしまったミネルバと空白旅団の一行は、過酷な労働を強いられ、疲弊してしまう。異常な疲労感に疑問を抱き、知恵者を集めて状況を整理すると――",
  "Story.108.4": "08A",
  "Story.109.1": "食後デザート",
  "Story.109.2": "フィキンに騙され雇用契約を結んでしまったミネルバと空白旅団の一行は、過酷な労働を強いられ、疲弊してしまう。食事を通して少しでも体力を取り戻そうとするが――",
  "Story.109.4": "08B",
  "Story.110.1": "未来のない巡遊者",
  "Story.110.2": "フィキンに騙され雇用契約を結んでしまったミネルバと空白旅団の一行は、過酷な労働を強いられ、疲弊してしまう。一行はそれでも力を合わせて借金返済のために働き続けるが――",
  "Story.110.4": "BE",
  "Story.111.1": "記憶を補填する方法",
  "Story.111.2": "白亜商会での労働により生じる異常な疲労感。その対応策を閃いた一行は、才媛・ミネルバの力を借りて――",
  "Story.111.4": "09",
  "Story.112.1": "規則の解釈",
  "Story.112.2": "状況が好転したと思ったのもつかの間、白亜商会のフィキンは一行への態度を急に硬化させる。難癖をつけたうえに理不尽な要求をするフィキンに対して、ミネルバは怒りを爆発させるが――",
  "Story.112.4": "10",
  "Story.201.1": "包囲網を抜けて",
  "Story.201.2": "ミネルバと空白旅団の一行は、オアシス号の奪還に成功したものの、謎の白髪の少女の介入でフィキンを取り逃がしてしまう――",
  "Story.201.4": "BT01",
  "Story.202.1": "異変と星骸",
  "Story.202.2": "白髪の少女に連れられ逃走したフィキンは、カンパニー戦争の敗勢を巻き返そうと悪あがきするのだが――",
  "Story.202.4": "BT02",
  "Story.203.1": "宿敵、再び",
  "Story.203.2": "空白旅団が砂漠で出会ったものと同様の星骸がアモールで暴れまわる。以前は倒せなかったが、あなたの秘策があれば――",
  "Story.203.4": "BT03",
  "Story.204.1": "カンパニーとオアシス",
  "Story.204.2": "あなたがかつて強大なカンパニーを率いる存在であったことが発覚する。しかし自身が記憶を失っていることもあり、半信半疑なあなたは、いったん別口で問題の解決を模索する――",
  "Story.204.4": "01",
  "Story.205.1": "深夜の作戦行動",
  "Story.205.2": "問題解決のため、まずオアシス号を奪還することにした一行は、ミネルバと相談のうえ、夜陰に乗じて白亜商会に乗り込むことにしたのだが――",
  "Story.205.4": "02A",
  "Story.206.1": "偵察任務",
  "Story.206.2": "問題解決のため、まずオアシス号を奪還することにした一行は、ミネルバと相談のうえ、プラチナ学院の学生だという彼女の立場を活かして再び白亜商会に潜り込むことにしたのだが――",
  "Story.206.4": "02B",
  "Story.207.1": "変わらないもの",
  "Story.207.2": "問題解決のため、まずオアシス号を奪還することにした一行は、ミネルバと相談のうえ、白亜商会が神器を運ぶために使うコンテナの中に隠れて紛れ込むことにしたのだが――",
  "Story.207.4": "BE",
  "Story.208.1": "暗夜中の視線",
  "Story.208.2": "深夜、白亜商会への侵入に成功した一行は、フィキンの不正の証拠を入手したうえに、オアシス号を取り返すことにも成功したのだが――",
  "Story.208.4": "03A",
  "Story.209.1": "退勤時間",
  "Story.209.2": "変装したミネルバの潜入が功を奏し、白亜商会の内情をうまく入手できた一行は、終業後を狙ってオアシス号を取り戻そうとするのだったが――",
  "Story.209.4": "03B",
  "Story.210.1": "黒の少女",
  "Story.210.2": "なりふり構わないフィキンの悪だくみによりおたずね者になってしまったミネルバと空白旅団は、賞金稼ぎの傭兵やギャング、それに帝国護衛隊の追跡から逃れようとするが――",
  "Story.210.4": "04",
  "Story.211.1": "主と刀",
  "Story.211.2": "追手の攻撃を受け窮地に立たされたミネルバや空白旅団を救ったのは、黒装束をまとった謎の少女であった。ひとまず敵の追撃をかわした一行は、念のため医者に診てもらうことにするが――",
  "Story.211.4": "05",
  "Story.212.1": "印章の力",
  "Story.212.2": "クルニスの治療を受けながら、窮地を救ってくれた少女・チトセに事情をたずねる一行。しかしそこに居場所を突き止めたフィキンたちが襲い掛かる――",
  "Story.212.4": "06",
  "Story.213.1": "4つの権利",
  "Story.213.2": "フィキンたちを撒いたミネルバと空白旅団の一行は、不利な状況を打開する作戦を考える――",
  "Story.213.4": "07",
  "Story.214.1": "魂の取引",
  "Story.214.2": "白亜商会に対抗するカンパニーを開設するため、心相ショップのベスティナをたずねるミネルバたち。そこで改めて、あなたがかつて率いていたというカンパニーの詳細を聞かされる――",
  "Story.214.4": "08",
  "Story.215.1": "一時間戦争",
  "Story.215.2": "『魔王プロトコル人材派遣カンパニー』の凍結を解除したあなたは、さっそく白亜商会を相手どったカンパニー戦争を宣戦する。この知らせはノヴァ大陸中に知れ渡り――",
  "Story.215.4": "09",
  "Story.216.1": "動き出すセカイ",
  "Story.216.2": "手段を選ばなくなったフィキンは街の中に星骸を解き放ち、住民を巻き込んだパニックを引き起こす。チトセの加勢を得てなんとか食い止めようとするものの――",
  "Story.216.4": "10",
  "Story.217.1": "新たな出発点",
  "Story.217.2": "アモールの街を襲った異変を無事解決し、白髪の少女・オーロラも打ち倒し、フィキンを捕らえることにも成功した空白旅団だったが――",
  "Story.217.4": "エピローグ",
  "Story.301.1": "実力判定",
  "Story.301.2": "特訓を始めるにあたり、まずは現在のフユカに足りないものを見極めなければならない。そこで主人公はナズナとともに、森の魔物と戦う彼女の動きを観察することにする。",
  "Story.301.4": "BT01",
  "Story.302.1": "激突、破砕ノ牙",
  "Story.302.2": "大切な仲間を守りたい。その強い気持ちが爆発したことで、ついに己の殻を打ち破ったフユカ。対峙する強大な魔物にも恐れを抱くことなく、全力を解放したその拳を振り上げる。",
  "Story.302.4": "BT02",
  "Story.304.1": "ヴェータ 前編",
  "Story.304.2": "フィーリエへ向かう途中、魔王と空白旅団しかいないはずのオアシス号の車内に、聞き慣れない声が響く。その声は、どうやら魔王の持つケータイから聞こえてきたようで…",
  "Story.304.4": "幕間 上",
  "Story.305.1": "ヴェータ 後編",
  "Story.305.2": "突如ケータイの中に現れた存在――ヴェータ。敵か味方かわからないが、ヴェータは様々な情報を提供してくれる。中でも特に空白旅団の気を引いたのは、願掛けしても記憶を失くさなくなるという話で…",
  "Story.305.4": "幕間 下",
  "Story.306.1": "三大依頼",
  "Story.306.2": "長い移動を経て、ようやくフィーリエへとたどり着いた空白旅団。セレナがいるという地理センの情報を集めるため、人の集まっているところを目指すが、そこで思いも寄らない情報を入手する。",
  "Story.306.4": "01",
  "Story.307.1": "森のクレーンマスター",
  "Story.307.2": "キャンプで得た地理センの情報を頼りに、森の中を突き進む。すると木々に埋もれているものの、ようやくそれらしい建物が見えてくる。しかしほとんど手入れされておらず、とても人がいるようには見えない…",
  "Story.307.4": "02",
  "Story.308.1": "花咲旅団",
  "Story.308.2": "夜になると、地理センに人が戻ってきた。どうやらここは地理センとしての機能を失っており、いまは『花咲旅団』が手入れをしつつ、拠点として利用しているのだという。",
  "Story.308.4": "03",
  "Story.309.1": "すれ違い",
  "Story.309.2": "ナズナの口から、いまフィーリエで起きている異常事態の詳細を聞かされる。そしてそれは花咲旅団にとっても重要な意味を持っていた。セレナはそんな状況をよく思っていないらしく…",
  "Story.309.4": "04",
  "Story.310.1": "苦い過去",
  "Story.310.2": "フユカをフィーリエの英雄にするための特訓が始まった。最初は順調に思えたが、空白旅団との連携を取ろうとしたところ、急に調子を崩し始める。どうやら過去の出来事が関係しているようだが…",
  "Story.310.4": "05",
  "Story.311.1": "メンタルトレーニング",
  "Story.311.2": "フユカが英雄になるには、まずそのトラウマを克服しなければならない。そこでいくつかの方法を試してみると…",
  "Story.311.4": "06A",
  "Story.312.1": "高負荷トレーニング？",
  "Story.312.2": "自らの力をコントロールできないのなら、無理矢理にでもその力を抑え込んでしまえば良い。そこで重りを使い、フユカの力を制限することにしたのだが……",
  "Story.312.4": "06B",
  "Story.313.1": "ショック療法？",
  "Story.313.2": "過去のツラい記憶がフラッシュバックしても、それに動じない度胸をつければトラウマを克服できる――そこでフユカに対し、ドッキリをしかけることにするが…",
  "Story.313.4": "BE",
  "Story.314.1": "恐怖に打ち勝つ方法",
  "Story.314.2": "レッドアイズの魔女、ミスティから独占取材を申し込まれたため、交換条件としてトラウマの解決方法を尋ねた。それにより事態は少しずつ進展をみせ、花咲旅団はある大きな決断をする…",
  "Story.314.4": "07",
  "Story.315.1": "行動開始！",
  "Story.315.2": "花咲旅団の実力を周囲に認めさせるには、まず討伐隊にその実力を見せつける必要がある。そこでナズナが作った三大依頼対策の資料を持って、討伐隊のもとへと共闘を申し入れに向かう。だがそこにナツカが現れ…",
  "Story.315.4": "08",
  "Story.316.1": "開花のとき",
  "Story.316.2": "空白旅団と花咲旅団は、森に潜んで破砕ノ牙がやってくるのを待ち伏せすることにした。そしていよいよそのときがやってきたのだが、魔物たちの勢いは想像以上に激しく苦戦を強いられてしまう…",
  "Story.316.4": "09",
  "Story.317.1": "師弟関係",
  "Story.317.2": "破砕ノ牙との戦闘の中で、フユカは自身でも気づかないうちに少しずつ成長を遂げていた。そして決着がついた先で、彼女が選択する未来は…",
  "Story.317.4": "10",
  "Story.318.1": "束の間の平穏",
  "Story.318.2": "空白旅団と花咲旅団の連合チームが三大依頼の一角を崩し、残す魔物はあと1体のみとなった。だが最後まで残った魔物の凶悪性を知るナツカは、神妙な面持ちを浮かべており…",
  "Story.318.4": "11"
}